import { HeaderServiceProps } from "types/headerServiceProps"

export const text: HeaderServiceProps = {
    intro: {
        title: "그룹소개",
        menu: [
            "JB금융그룹 소개", "CEO 인사말", "그룹비전",
            "연혁", "계열사 소개", "윤리경영", "CI 소개", "연수원 소개"
        ],
        subMenu: [
            [], [], [], [], [], [], [], []
        ]
    },
    structure: {
        title: "기업지배구조",
        menu: [
            "이사회", "조직도", "주주총회", "관련 규정",
            "지배구조공시", "외부감사인 현황"
        ],
        subMenu: [
            ["구성 현황", "이사회 내 위원회", "주요 활동 내역"],
            [], ["주주현황", "주주총회 결과", "주주총회 관련 자료"],
            ["정관", "지배구조내부규범", "이사회규정"], [], []
        ]
    },
    info: {
        title: "투자정보",
        menu: [
            "Investor Relations", "기업가치 제고 계획",
            "공시정보", "경영실적", "재무정보", "IR활동",
            "주가정보", "주주환원", "신용등급"
        ],
        subMenu: [
            [], [], 
            ["공시자료", "경영공시", "사업보고서", "감사보고서", 
            "영업보고서", "공고", "공시규정"],
            ["실적발표", "Annual Report"], 
            ["재무상태표", "손익계산서", "주요재무지표"], [],
            ["현재가시세", "분단위시세", "일자별시세", "외국인매매",
            "차트분석", "시장동향", "동업종비교"], [], []
        ]
    },
    center: {
        title: "PR센터",
        menu: [
            "보도자료", "홍보영상", "공지사항"
        ],
        subMenu: [
            [], [], ["입찰정보", "채용정보"]
        ]
    },
    esg: {
        title: "ESG",
        menu: [
            "ESG 전략체계", "ESG 지배구조", "ESG 정책 및 가이드라인",
            "ESG 성과", "ESG 보고서", "사회공헌"
        ],
        subMenu: [
            [], [], [],
            ["ESG 대외평가", "ESG 이니셔티브"],
            [], []
        ]
    }
}